MishaSpir/STM32_SPI/NFR24L01.cpp
#include "NRF_Master/NRF24L01.hpp"
#include "NRF_Master/nRF24L01.h"

/****************************************************************************/

void NRF24::Setup_SPI()
{
    rcc_periph_clock_enable(RCC_GPIOA);

    rcc_periph_clock_enable(RCC_SPI1);
    gpio_mode_setup(GPIOA, GPIO_MODE_AF, GPIO_PUPD_NONE, GPIO5 | GPIO6 | GPIO7);
    gpio_set_af(GPIOA, GPIO_AF5, GPIO5 | GPIO6 | GPIO7);
    gpio_set_output_options(GPIOA, GPIO_OTYPE_PP, GPIO_OSPEED_2MHZ, GPIO5 | GPIO6 | GPIO7);

    spi_disable(SPI1);
    spi_set_master_mode(SPI1);
    spi_set_full_duplex_mode(SPI1);
    spi_set_baudrate_prescaler(SPI1, SPI_CR1_BR_FPCLK_DIV_32);
    spi_set_clock_polarity_0(SPI1);
    spi_set_clock_phase_0(SPI1);
    // spi_set_data_size(SPI2, SPI_CR2_DS_8BIT);
    spi_send_msb_first(SPI1);
    spi_enable_software_slave_management(SPI1);
    spi_set_nss_high(SPI1);
    spi_enable_ss_output(SPI1);
    // spi_fifo_reception_threshold_8bit(SPI2);

    spi_enable(SPI1);
}

/****************************************************************************/

void NRF24::Setup_CE() 
{
	rcc_periph_clock_enable(RCC_GPIOA);
	gpio_mode_setup(GPIOA, GPIO_MODE_OUTPUT, GPIO_PUPD_NONE, GPIO3);
}

/****************************************************************************/

void NRF24::Setup_CSN()
{
	rcc_periph_clock_enable(RCC_GPIOA);
	gpio_mode_setup(GPIOA, GPIO_MODE_OUTPUT, GPIO_PUPD_NONE, GPIO4);
    gpio_set(GPIOA, GPIO4);
}

/****************************************************************************/

void NRF24::Timer_delay_10us(uint32_t data)
{
uint32_t time = (timer_get_counter(TIM2) + data);

    while (time > timer_get_counter(TIM2)){
     asm("nop");
    }
}

/****************************************************************************/

void NRF24::Timer_delay_1ms(uint32_t data)
{
uint32_t time = (timer_get_counter(TIM2) + data*100);

    while (time > timer_get_counter(TIM2)){
     asm("nop");
    }
}

/****************************************************************************/

void NRF24::csn(int mode)
{
  // Minimum ideal SPI bus speed is 2x data rate
  // If we assume 2Mbs data rate and 16Mhz clock, a
  // divider of 4 is the minimum we want.
  // CLK:BUS 8Mhz:2Mhz, 16Mhz:4Mhz, or 20Mhz:5Mhz
  if (mode == HIGH) {
    gpio_set(GPIOA, GPIO4);
  } else { 
    gpio_clear(GPIOA, GPIO4);
  }
}

/****************************************************************************/

void NRF24::ce(int level)
{
    if (level == HIGH) {
        gpio_set(GPIOA, GPIO3);
    } else {
        gpio_clear(GPIOA, GPIO3);
    }
}

/****************************************************************************/

void NRF24::send_SPI (uint8_t data)
{
    spi_send(SPI1, data);
          for (volatile uint32_t i = 0; i < 70; i++) {
        asm("nop");
    }
}

/****************************************************************************/

uint8_t NRF24::read_SPI ()
{
  return spi_read(SPI1);
}

/****************************************************************************/

uint8_t NRF24::Transfer_SPI(uint8_t data)
{
  uint8_t read_data;
  send_SPI(data);
  read_data = read_SPI();
  return read_data;
}

/****************************************************************************/

uint8_t NRF24::read_register(uint8_t reg, uint8_t* buf, uint8_t len)
{
  uint8_t status;

  csn(LOW);
  status = Transfer_SPI( R_REGISTER | ( REGISTER_MASK & reg ) );
  while ( len-- )
    *buf++ = Transfer_SPI(0xff);

  csn(HIGH);

  return status;
}

/****************************************************************************/

uint8_t NRF24::read_register(uint8_t reg)
{
  csn(LOW);
  Transfer_SPI( R_REGISTER | ( REGISTER_MASK & reg ) );
  uint8_t result = Transfer_SPI(0xff);

  csn(HIGH);
  return result;
}

/****************************************************************************/

uint8_t NRF24::write_register(uint8_t reg, const uint8_t* buf, uint8_t len)
{
  uint8_t status;

  csn(LOW);
  status = Transfer_SPI( W_REGISTER | ( REGISTER_MASK & reg ) );
  while ( len-- )
    Transfer_SPI(*buf++);

  csn(HIGH);

  return status;
}

/****************************************************************************/

uint8_t NRF24::write_register(uint8_t reg, uint8_t value)
{
  uint8_t status;

  csn(LOW);
  status = Transfer_SPI( W_REGISTER | ( REGISTER_MASK & reg ) );
  Transfer_SPI(value);
  csn(HIGH);

  return status;
}

/****************************************************************************/

uint8_t NRF24::write_payload(const void* buf, uint8_t len)
{
  uint8_t status;

  const uint8_t* current = reinterpret_cast<const uint8_t*>(buf);

  uint8_t data_len = rf24_min(len,payload_size);
  uint8_t blank_len = dynamic_payloads_enabled ? 0 : payload_size - data_len;
  
  csn(LOW);
  status = Transfer_SPI( W_TX_PAYLOAD );
  while ( data_len-- )
    Transfer_SPI(*current++);
  while ( blank_len-- )
    Transfer_SPI(0);
  csn(HIGH);

  return status;
}

/****************************************************************************/

uint8_t NRF24::read_payload(void* buf, uint8_t len)
{
  uint8_t status;
  uint8_t* current = reinterpret_cast<uint8_t*>(buf);

  uint8_t data_len = rf24_min(len,payload_size);
  uint8_t blank_len = dynamic_payloads_enabled ? 0 : payload_size - data_len;
  
  csn(LOW);
  status = Transfer_SPI( R_RX_PAYLOAD );
  while ( data_len-- )
    *current++ = Transfer_SPI(0xff);
  while ( blank_len-- )
    Transfer_SPI(0xff);
  csn(HIGH);

  return status;
}

/****************************************************************************/

uint8_t NRF24::flush_rx(void)
{
  uint8_t status;

  csn(LOW);
  status = Transfer_SPI( FLUSH_RX );
  csn(HIGH);

  return status;
}

/****************************************************************************/

uint8_t NRF24::flush_tx(void)
{
  uint8_t status;

  csn(LOW);
  status = Transfer_SPI( FLUSH_TX );
  csn(HIGH);

  return status;
}

/****************************************************************************/

uint8_t NRF24::get_status(void)
{
  uint8_t status;

  csn(LOW);
  status = Transfer_SPI( NOP );
  csn(HIGH);

